---
kind: property
id: P:Autodesk.Revit.DB.WallType.ThermalProperties
source: html/d7024079-2d74-5758-4de7-ffb1c170f168.htm
---
# Autodesk.Revit.DB.WallType.ThermalProperties Property

The calculated and settable thermal properties of the WallType

## Syntax (C#)
```csharp
public ThermalProperties ThermalProperties { get; }
```

## Remarks
Returns Nothing nullptr a null reference ( Nothing in Visual Basic) if the wall has no thermal properties.
 Curtain walls and stacked walls do not store thermal properties.